<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"dada1140ab7441acee8fdfe42084bc31a97c042ab617cdca0d667e41737f9a73","plan_job_ref":"Job Pull Request Checks #54 at https://github.com/GSA-TTS/FAC/actions/runs/16692717388","plan_out_hash":"477a936b5a3e2eb9af53fc188dee335579383599a62e32c77d236326c8cd1f10","plan_hash":"396825dcfabed36ac6c8f83e31780b8b07b36a8350d338bb73b347aca8eaed2b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 3 to add, 5 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.production.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.production.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
!~      policies = [
!~          {
!~              source_app      = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.production.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:12026a37f8869070bd84edc785097c16bf11308b9ea31efa0f27512bfb97b25f" -> "ghcr.io/gsa-tts/fac/clamav@sha256:92de1213a6acc4f94bd7f7e02b40af2a496f914ed5c27dc86ba81aca50829cdf"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-production.apps.internal" -> null
            },
        ] -> (known after apply)
+       service_bindings                = (known after apply) # forces replacement
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-07-23T15:54:38Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-07-23T15:53:24Z" -> (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:12026a37f8869070bd84edc785097c16bf11308b9ea31efa0f27512bfb97b25f" -> "ghcr.io/gsa-tts/fac/clamav@sha256:92de1213a6acc4f94bd7f7e02b40af2a496f914ed5c27dc86ba81aca50829cdf"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-production-fs.apps.internal" -> null
            },
        ] -> (known after apply)
+       service_bindings                = (known after apply) # forces replacement
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-07-23T15:54:08Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.production.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-               app_process_type = "web" -> null
-               id               = "68e16414-09a5-4efc-b00a-6ec2344161a2" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "5ae55cd7-5641-4974-a489-56a5cf2c7524"
!~      updated_at   = "2025-04-21T20:54:32Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
-               app_process_type = "web" -> null
-               id               = "19e04ea2-1e61-4c0b-ba8f-c72e96edcc66" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "d26de6d0-1911-421d-a80d-54e05c8bad39"
!~      updated_at   = "2025-07-17T13:22:18Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 3 to add, 5 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #54](https://github.com/GSA-TTS/FAC/actions/runs/16692717388)